### YamlMime:AzureCLIGroup
uid: az_monitor_log-analytics
name: az monitor log-analytics
summary: Manage Azure log analytics.
description: ''
directCommands:
- uid: az_monitor_log-analytics_query
  name: az monitor log-analytics query
  summary: Query a Log Analytics workspace.
  description: ''
  syntax: >-
    az monitor log-analytics query --analytics-query
                                   --workspace
                                   [--timespan]
                                   [--workspaces]
  examples:
  - summary: Execute a simple query over past 3.5 days.
    syntax: az monitor log-analytics query -w workspace-customId --analytics-query "AzureActivity | summarize count() by bin(timestamp, 1h)" -t P3DT12H
  - summary: Execute a saved query in workspace
    syntax: >-
      QUERY=$(az monitor log-analytics workspace saved-search show -g resource-group --workspace-name workspace-name -n query-name --query query --output tsv)

      az monitor log-analytics query -w workspace-customId --analytics-query "$QUERY"
  requiredParameters:
  - isRequired: true
    name: --analytics-query
    summary: Query to execute over Log Analytics data.
    description: ''
  - isRequired: true
    name: --workspace -w
    summary: GUID of the Log Analytics Workspace.
    description: ''
  optionalParameters:
  - name: --timespan -t
    summary: Timespan over which to query. Defaults to querying all available data.
    description: ''
  - name: --workspaces
    summary: Additional workspaces to union data for querying. Specify additional workspace IDs separated by space.
    description: ''
commands:
- az_monitor_log-analytics_cluster
- az_monitor_log-analytics_cluster_create
- az_monitor_log-analytics_cluster_delete
- az_monitor_log-analytics_cluster_list
- az_monitor_log-analytics_cluster_show
- az_monitor_log-analytics_cluster_update
- az_monitor_log-analytics_cluster_wait
- az_monitor_log-analytics_query
- az_monitor_log-analytics_query-pack
- az_monitor_log-analytics_query-pack_create
- az_monitor_log-analytics_query-pack_delete
- az_monitor_log-analytics_query-pack_list
- az_monitor_log-analytics_query-pack_query
- az_monitor_log-analytics_query-pack_query_create
- az_monitor_log-analytics_query-pack_query_delete
- az_monitor_log-analytics_query-pack_query_list
- az_monitor_log-analytics_query-pack_query_search
- az_monitor_log-analytics_query-pack_query_show
- az_monitor_log-analytics_query-pack_query_update
- az_monitor_log-analytics_query-pack_show
- az_monitor_log-analytics_query-pack_update
- az_monitor_log-analytics_solution
- az_monitor_log-analytics_solution_create
- az_monitor_log-analytics_solution_delete
- az_monitor_log-analytics_solution_list
- az_monitor_log-analytics_solution_show
- az_monitor_log-analytics_solution_update
- az_monitor_log-analytics_workspace
- az_monitor_log-analytics_workspace_create
- az_monitor_log-analytics_workspace_data-export
- az_monitor_log-analytics_workspace_data-export_create
- az_monitor_log-analytics_workspace_data-export_delete
- az_monitor_log-analytics_workspace_data-export_list
- az_monitor_log-analytics_workspace_data-export_show
- az_monitor_log-analytics_workspace_data-export_update
- az_monitor_log-analytics_workspace_delete
- az_monitor_log-analytics_workspace_get-schema
- az_monitor_log-analytics_workspace_get-shared-keys
- az_monitor_log-analytics_workspace_linked-service
- az_monitor_log-analytics_workspace_linked-service_create
- az_monitor_log-analytics_workspace_linked-service_delete
- az_monitor_log-analytics_workspace_linked-service_list
- az_monitor_log-analytics_workspace_linked-service_show
- az_monitor_log-analytics_workspace_linked-service_update
- az_monitor_log-analytics_workspace_linked-service_wait
- az_monitor_log-analytics_workspace_linked-storage
- az_monitor_log-analytics_workspace_linked-storage_add
- az_monitor_log-analytics_workspace_linked-storage_create
- az_monitor_log-analytics_workspace_linked-storage_delete
- az_monitor_log-analytics_workspace_linked-storage_list
- az_monitor_log-analytics_workspace_linked-storage_remove
- az_monitor_log-analytics_workspace_linked-storage_show
- az_monitor_log-analytics_workspace_list
- az_monitor_log-analytics_workspace_list-deleted-workspaces
- az_monitor_log-analytics_workspace_list-management-groups
- az_monitor_log-analytics_workspace_list-usages
- az_monitor_log-analytics_workspace_pack
- az_monitor_log-analytics_workspace_pack_disable
- az_monitor_log-analytics_workspace_pack_enable
- az_monitor_log-analytics_workspace_pack_list
- az_monitor_log-analytics_workspace_recover
- az_monitor_log-analytics_workspace_saved-search
- az_monitor_log-analytics_workspace_saved-search_create
- az_monitor_log-analytics_workspace_saved-search_delete
- az_monitor_log-analytics_workspace_saved-search_list
- az_monitor_log-analytics_workspace_saved-search_show
- az_monitor_log-analytics_workspace_saved-search_update
- az_monitor_log-analytics_workspace_show
- az_monitor_log-analytics_workspace_table
- az_monitor_log-analytics_workspace_table_create
- az_monitor_log-analytics_workspace_table_delete
- az_monitor_log-analytics_workspace_table_list
- az_monitor_log-analytics_workspace_table_migrate
- az_monitor_log-analytics_workspace_table_restore
- az_monitor_log-analytics_workspace_table_restore_create
- az_monitor_log-analytics_workspace_table_search-job
- az_monitor_log-analytics_workspace_table_search-job_create
- az_monitor_log-analytics_workspace_table_show
- az_monitor_log-analytics_workspace_table_update
- az_monitor_log-analytics_workspace_table_wait
- az_monitor_log-analytics_workspace_update
- az_monitor_log-analytics_workspace_wait
globalParameters:
- name: --debug
  summary: Increase logging verbosity to show all debug logs.
- name: --help -h
  summary: Show this help message and exit.
- name: --only-show-errors
  summary: Only show errors, suppressing warnings.
- name: --output -o
  defaultValue: "json"
  parameterValueGroup: "json, jsonc, table, tsv"
  summary: Output format.
- name: --query
  summary: JMESPath query string. See <a href="http://jmespath.org/">http://jmespath.org/</a> for more information and examples.
- name: --subscription
  summary: Name or ID of subscription. You can configure the default subscription using `az account set -s NAME_OR_ID`.
- name: --verbose
  summary: Increase logging verbosity. Use --debug for full debug logs.
metadata:
  description: Manage Azure log analytics.
