### YamlMime:AzureCLIGroup
uid: az_monitor_log-analytics
name: az monitor log-analytics
importantNote: >-
  > [!Note]

  > This command group has descendant commands that are defined in both Azure CLI core and at least one Azure CLI extension. If you wish to use the extension commands, you must install the extension. [Learn more](https://learn.microsoft.com/cli/azure/azure-cli-extensions-overview) about extensions.
summary: Manage Azure log analytics.
description: ''
status: GA
sourceType: Core and Extension
directCommands:
- uid: az_monitor_log-analytics_query_(log-analytics)
  name: az monitor log-analytics query
  summary: Query a Log Analytics workspace.
  description: ''
  status: GA
  sourceType: Extension
  syntax: >-
    az monitor log-analytics query --analytics-query
                                   --workspace
                                   [--timespan]
                                   [--workspaces]
  examples:
  - summary: Execute a simple query over past 3.5 days.
    syntax: az monitor log-analytics query -w workspace-customId --analytics-query "AzureActivity | summarize count() by bin(timestamp, 1h)" -t P3DT12H
  - summary: Execute a saved query in workspace
    syntax: >-
      QUERY=$(az monitor log-analytics workspace saved-search show -g resource-group --workspace-name workspace-name -n query-name --query query --output tsv)

      az monitor log-analytics query -w workspace-customId --analytics-query "$QUERY"
  requiredParameters:
  - isRequired: true
    name: --analytics-query
    summary: Query to execute over Log Analytics data.
    description: ''
  - isRequired: true
    name: --workspace -w
    summary: GUID of the Log Analytics Workspace.
    description: ''
  optionalParameters:
  - name: --timespan -t
    summary: Timespan over which to query. Defaults to querying all available data.
    description: ''
  - name: --workspaces
    summary: Additional workspaces to union data for querying. Specify additional workspace IDs separated by space.
    description: ''
commands:
- az_monitor_log-analytics_cluster
- az_monitor_log-analytics_cluster_create_()
- az_monitor_log-analytics_cluster_delete_()
- az_monitor_log-analytics_cluster_list_()
- az_monitor_log-analytics_cluster_show_()
- az_monitor_log-analytics_cluster_update_()
- az_monitor_log-analytics_cluster_wait_()
- az_monitor_log-analytics_query_(log-analytics)
- az_monitor_log-analytics_query-pack
- az_monitor_log-analytics_query-pack_create_()
- az_monitor_log-analytics_query-pack_delete_()
- az_monitor_log-analytics_query-pack_list_()
- az_monitor_log-analytics_query-pack_query
- az_monitor_log-analytics_query-pack_query_create_()
- az_monitor_log-analytics_query-pack_query_delete_()
- az_monitor_log-analytics_query-pack_query_list_()
- az_monitor_log-analytics_query-pack_query_search_()
- az_monitor_log-analytics_query-pack_query_show_()
- az_monitor_log-analytics_query-pack_query_update_()
- az_monitor_log-analytics_query-pack_show_()
- az_monitor_log-analytics_query-pack_update_()
- az_monitor_log-analytics_solution
- az_monitor_log-analytics_solution_create_(log-analytics-solution)
- az_monitor_log-analytics_solution_delete_(log-analytics-solution)
- az_monitor_log-analytics_solution_list_(log-analytics-solution)
- az_monitor_log-analytics_solution_show_(log-analytics-solution)
- az_monitor_log-analytics_solution_update_(log-analytics-solution)
- az_monitor_log-analytics_workspace
- az_monitor_log-analytics_workspace_create_()
- az_monitor_log-analytics_workspace_data-export
- az_monitor_log-analytics_workspace_data-export_create_()
- az_monitor_log-analytics_workspace_data-export_delete_()
- az_monitor_log-analytics_workspace_data-export_list_()
- az_monitor_log-analytics_workspace_data-export_show_()
- az_monitor_log-analytics_workspace_data-export_update_()
- az_monitor_log-analytics_workspace_delete_()
- az_monitor_log-analytics_workspace_get-schema_()
- az_monitor_log-analytics_workspace_get-shared-keys_()
- az_monitor_log-analytics_workspace_linked-service
- az_monitor_log-analytics_workspace_linked-service_create_()
- az_monitor_log-analytics_workspace_linked-service_delete_()
- az_monitor_log-analytics_workspace_linked-service_list_()
- az_monitor_log-analytics_workspace_linked-service_show_()
- az_monitor_log-analytics_workspace_linked-service_update_()
- az_monitor_log-analytics_workspace_linked-service_wait_()
- az_monitor_log-analytics_workspace_linked-storage
- az_monitor_log-analytics_workspace_linked-storage_add_()
- az_monitor_log-analytics_workspace_linked-storage_create_()
- az_monitor_log-analytics_workspace_linked-storage_delete_()
- az_monitor_log-analytics_workspace_linked-storage_list_()
- az_monitor_log-analytics_workspace_linked-storage_remove_()
- az_monitor_log-analytics_workspace_linked-storage_show_()
- az_monitor_log-analytics_workspace_list_()
- az_monitor_log-analytics_workspace_list-deleted-workspaces_()
- az_monitor_log-analytics_workspace_list-management-groups_()
- az_monitor_log-analytics_workspace_list-usages_()
- az_monitor_log-analytics_workspace_pack
- az_monitor_log-analytics_workspace_pack_disable_()
- az_monitor_log-analytics_workspace_pack_enable_()
- az_monitor_log-analytics_workspace_pack_list_()
- az_monitor_log-analytics_workspace_recover_()
- az_monitor_log-analytics_workspace_saved-search
- az_monitor_log-analytics_workspace_saved-search_create_()
- az_monitor_log-analytics_workspace_saved-search_delete_()
- az_monitor_log-analytics_workspace_saved-search_list_()
- az_monitor_log-analytics_workspace_saved-search_show_()
- az_monitor_log-analytics_workspace_saved-search_update_()
- az_monitor_log-analytics_workspace_show_()
- az_monitor_log-analytics_workspace_table
- az_monitor_log-analytics_workspace_table_create_()
- az_monitor_log-analytics_workspace_table_delete_()
- az_monitor_log-analytics_workspace_table_list_()
- az_monitor_log-analytics_workspace_table_migrate_()
- az_monitor_log-analytics_workspace_table_restore
- az_monitor_log-analytics_workspace_table_restore_create_()
- az_monitor_log-analytics_workspace_table_search-job
- az_monitor_log-analytics_workspace_table_search-job_create_()
- az_monitor_log-analytics_workspace_table_show_()
- az_monitor_log-analytics_workspace_table_update_()
- az_monitor_log-analytics_workspace_table_wait_()
- az_monitor_log-analytics_workspace_update_()
- az_monitor_log-analytics_workspace_wait_()
globalParameters:
- name: --debug
  summary: Increase logging verbosity to show all debug logs.
- name: --help -h
  summary: Show this help message and exit.
- name: --only-show-errors
  summary: Only show errors, suppressing warnings.
- name: --output -o
  defaultValue: "json"
  parameterValueGroup: "json, jsonc, table, tsv"
  summary: Output format.
- name: --query
  summary: JMESPath query string. See <a href="http://jmespath.org/">http://jmespath.org/</a> for more information and examples.
- name: --subscription
  summary: Name or ID of subscription. You can configure the default subscription using `az account set -s NAME_OR_ID`.
- name: --verbose
  summary: Increase logging verbosity. Use --debug for full debug logs.
metadata:
  description: Manage Azure log analytics.
