### YamlMime:AzureCLIGroup
uid: ext_sentinel_az_sentinel_bookmark
name: az sentinel bookmark
extensionInformation: >-
  > [!Note]

  > This reference is part of the **sentinel** extension for Azure CLI and requires version 2.11.0 or higher.  The extension will automatically install the first time you run an **az sentinel bookmark** command.  [Learn more](https://docs.microsoft.com/en-us/cli/azure/azure-cli-extensions-overview) about extensions.
summary: Sentinel bookmark.
description: ''
directCommands:
- uid: ext_sentinel_az_sentinel_bookmark_create
  name: az sentinel bookmark create
  summary: Create the bookmark.
  description: ''
  syntax: >-
    az sentinel bookmark create --bookmark-id
                                --resource-group
                                --workspace-name
                                [--created]
                                [--display-name]
                                [--etag]
                                [--incident-info]
                                [--labels]
                                [--notes]
                                [--query-result]
                                [--updated]
                                [--updated-by-object-id]
                                [-q]
  examples:
  - summary: Creates or updates a bookmark.
    syntax: az sentinel bookmark create --etag "{etag}" --created "2019-01-01T13:15:30Z" --display-name "My bookmark" --labels "Tag1" --labels "Tag2" --notes "Found a suspicious activity" -q "SecurityEvent | where TimeGenerated > ago(1d) and TimeGenerated < ago(2d)" --query-result "Security Event query result" --updated "2019-01-01T13:15:30Z" --bookmark-id "{id}" --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: Bookmark ID.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: The name of the workspace.
    description: ''
  optionalParameters:
  - name: --created
    summary: The time the bookmark was created.
    description: ''
  - name: --display-name
    summary: The display name of the bookmark.
    description: ''
  - name: --etag
    summary: Etag of the azure resource.
    description: ''
  - name: --incident-info
    summary: Describes an incident that relates to bookmark.
    description: >-
      Usage: --incident-info incident-id=XX severity=XX title=XX relation-name=XX


      incident-id: Required. Incident Id

      severity: Required. The severity of the incident

      title: Required. The title of the incident

      relation-name: Required. Relation Name.
  - name: --labels
    summary: List of labels relevant to this bookmark.
    description: ''
  - name: --notes
    summary: The notes of the bookmark.
    description: ''
  - name: --query-result
    summary: The query result of the bookmark.
    description: ''
  - name: --updated
    summary: The last time the bookmark was updated.
    description: ''
  - name: --updated-by-object-id
    summary: The object id of the user.
    description: ''
  - name: -q
    summary: The query of the bookmark.
    description: ''
- uid: ext_sentinel_az_sentinel_bookmark_delete
  name: az sentinel bookmark delete
  summary: Delete the bookmark.
  description: ''
  syntax: >-
    az sentinel bookmark delete --bookmark-id
                                --resource-group
                                --workspace-name
                                [--yes]
  examples:
  - summary: Delete a bookmark.
    syntax: az sentinel bookmark delete --bookmark-id "{id}" --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: Bookmark ID.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: The name of the workspace.
    description: ''
  optionalParameters:
  - name: --yes -y
    summary: Do not prompt for confirmation.
    description: ''
- uid: ext_sentinel_az_sentinel_bookmark_list
  name: az sentinel bookmark list
  summary: Gets all bookmarks.
  description: ''
  syntax: >-
    az sentinel bookmark list --resource-group
                              --workspace-name
  examples:
  - summary: Get all bookmarks.
    syntax: az sentinel bookmark list --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: The name of the workspace.
    description: ''
- uid: ext_sentinel_az_sentinel_bookmark_show
  name: az sentinel bookmark show
  summary: Gets a bookmark.
  description: ''
  syntax: >-
    az sentinel bookmark show --bookmark-id
                              --resource-group
                              --workspace-name
  examples:
  - summary: Get a bookmark.
    syntax: az sentinel bookmark show --bookmark-id "{id}" --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: Bookmark ID.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: The name of the workspace.
    description: ''
- uid: ext_sentinel_az_sentinel_bookmark_update
  name: az sentinel bookmark update
  summary: Update the bookmark.
  description: ''
  syntax: >-
    az sentinel bookmark update --bookmark-id
                                --resource-group
                                --workspace-name
                                [--created]
                                [--display-name]
                                [--etag]
                                [--incident-info]
                                [--labels]
                                [--notes]
                                [--query-result]
                                [--updated]
                                [--updated-by-object-id]
                                [-q]
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: Bookmark ID.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: The name of the workspace.
    description: ''
  optionalParameters:
  - name: --created
    summary: The time the bookmark was created.
    description: ''
  - name: --display-name
    summary: The display name of the bookmark.
    description: ''
  - name: --etag
    summary: Etag of the azure resource.
    description: ''
  - name: --incident-info
    summary: Describes an incident that relates to bookmark.
    description: >-
      Usage: --incident-info incident-id=XX severity=XX title=XX relation-name=XX


      incident-id: Required. Incident Id

      severity: Required. The severity of the incident

      title: Required. The title of the incident

      relation-name: Required. Relation Name.
  - name: --labels
    summary: List of labels relevant to this bookmark.
    description: ''
  - name: --notes
    summary: The notes of the bookmark.
    description: ''
  - name: --query-result
    summary: The query result of the bookmark.
    description: ''
  - name: --updated
    summary: The last time the bookmark was updated.
    description: ''
  - name: --updated-by-object-id
    summary: The object id of the user.
    description: ''
  - name: -q
    summary: The query of the bookmark.
    description: ''
commands:
- ext_sentinel_az_sentinel_bookmark_create
- ext_sentinel_az_sentinel_bookmark_delete
- ext_sentinel_az_sentinel_bookmark_list
- ext_sentinel_az_sentinel_bookmark_show
- ext_sentinel_az_sentinel_bookmark_update
globalParameters:
- name: --debug
  summary: Increase logging verbosity to show all debug logs.
- name: --help -h
  summary: Show this help message and exit.
- name: --only-show-errors
  summary: Only show errors, suppressing warnings.
- name: --output -o
  defaultValue: json
  parameterValueGroup: json, jsonc, table, tsv
  summary: Output format.
- name: --query
  summary: JMESPath query string. See <a href="http://jmespath.org/">http://jmespath.org/</a> for more information and examples.
- name: --verbose
  summary: Increase logging verbosity. Use --debug for full debug logs.
metadata:
  description: Sentinel bookmark.
