### YamlMime:AzureCLIGroup
uid: az_monitor_log-analytics
name: az monitor log-analytics
importantNote: >-
  > [!NOTE]

  > This command group has commands that are defined in two or more extensions. Each extension will automatically install the first time you run an extension command. [Learn more](https://learn.microsoft.com/cli/azure/azure-cli-extensions-overview) about extensions.
summary: |-
  Commands for querying data in Log Analytics workspaces.
status: GA
sourceType: Extension
directCommands:
- uid: az_monitor_log-analytics_query
  name: az monitor log-analytics query
  summary: |-
    Query a Log Analytics workspace.
  status: GA
  sourceType: Extension
  syntax: >-
    az monitor log-analytics query --analytics-query
                                   --workspace
                                   [--timespan]
                                   [--workspaces]
  examples:
  - summary: |-
      Execute a simple query over past 3.5 days.
    syntax: az monitor log-analytics query -w workspace-customId --analytics-query "AzureActivity | summarize count() by bin(timestamp, 1h)" -t P3DT12H
  - summary: |-
      Execute a saved query in workspace
    syntax: >-
      QUERY=$(az monitor log-analytics workspace saved-search show -g resource-group --workspace-name workspace-name -n query-name --query query --output tsv)

      az monitor log-analytics query -w workspace-customId --analytics-query "$QUERY"
  requiredParameters:
  - isRequired: true
    name: --analytics-query
    summary: |-
      Query to execute over Log Analytics data.
  - isRequired: true
    name: --workspace -w
    summary: |-
      GUID of the Log Analytics Workspace.
  optionalParameters:
  - name: --timespan -t
    summary: |-
      Timespan over which to query. Defaults to querying all available data.
  - name: --workspaces
    summary: |-
      Additional workspaces to union data for querying. Specify additional workspace IDs separated by space.
commands:
- az_monitor_log-analytics_query
- az_monitor_log-analytics_solution
- az_monitor_log-analytics_solution_create
- az_monitor_log-analytics_solution_delete
- az_monitor_log-analytics_solution_list
- az_monitor_log-analytics_solution_show
- az_monitor_log-analytics_solution_update
- az_monitor_log-analytics_solution_wait
globalParameters:
- name: --debug
  summary: |-
    Increase logging verbosity to show all debug logs.
- name: --help -h
  summary: |-
    Show this help message and exit.
- name: --only-show-errors
  summary: |-
    Only show errors, suppressing warnings.
- name: --output -o
  defaultValue: "json"
  parameterValueGroup: "json, jsonc, table, tsv"
  summary: |-
    Output format.
- name: --query
  summary: |-
    JMESPath query string. See <a href="http://jmespath.org/">http://jmespath.org/</a> for more information and examples.
- name: --subscription
  summary: |-
    Name or ID of subscription. You can configure the default subscription using `az account set -s NAME_OR_ID`.
- name: --verbose
  summary: |-
    Increase logging verbosity. Use --debug for full debug logs.
metadata:
  description: Commands for querying data in Log Analytics workspaces.
