### YamlMime:AzureCLIGroup
uid: az_monitor_log_analytics_workspace_saved_search
name: az monitor log-analytics workspace saved-search
summary: Manage saved search for log analytics workspace.
description: ''
directCommands:
- uid: az_monitor_log_analytics_workspace_saved_search_create
  name: az monitor log-analytics workspace saved-search create
  summary: Create a saved search for a given workspace.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search create --category
                                                           --display-name
                                                           --name
                                                           --resource-group
                                                           --saved-query
                                                           --workspace-name
                                                           [--fa]
                                                           [--fp]
                                                           [--subscription]
                                                           [--tags]
  examples:
  - summary: Create a saved search for a given workspace.
    syntax: az monitor log-analytics workspace saved-search create -g MyRG --workspace-name MyWS -n MySavedSearch --category Test1 --display-name TestSavedSearch -q "AzureActivity | summarize count() by bin(timestamp, 1h)" --fa myfun --fp "a:string = value"
  requiredParameters:
  - isRequired: true
    name: --category
    summary: The category of the saved search. This helps the user to find a saved search faster.
    description: ''
  - isRequired: true
    name: --display-name
    summary: Display name of the saved search.
    description: ''
  - isRequired: true
    name: --name -n
    summary: Name of the saved search and it's unique in a given workspace.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --saved-query -q
    summary: The query expression for the saved search.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Name of the Log Analytics Workspace.
    description: ''
  optionalParameters:
  - name: --fa --func-alias
    summary: Function Aliases are short names given to Saved Searches so they can be easily referenced in query. They are required for Computer Groups.
    description: ''
  - name: --fp --func-param
    summary: "The optional function parameters if query serves as a function. Value should be in the following format: 'param-name1:type1 = default_value1, param-name2:type2 = default_value2'. For more examples and proper syntax please refer to https://docs.microsoft.com/en-us/azure/kusto/query/functions/user-defined-functions."
    description: ''
  - name: --subscription
    summary: Name or ID of subscription. You can configure the default subscription using `az account set -s NAME_OR_ID`.
    description: ''
  - name: --tags
    summary: 'Space-separated tags: key[=value] [key[=value] ...]. Use "" to clear existing tags.'
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log_analytics_workspace_saved_search_delete
  name: az monitor log-analytics workspace saved-search delete
  summary: Delete a saved search for a given workspace.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search delete --name
                                                           --resource-group
                                                           --workspace-name
                                                           [--subscription]
                                                           [--yes]
  requiredParameters:
  - isRequired: true
    name: --name -n
    summary: Name of the saved search and it's unique in a given workspace.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Name of the Log Analytics Workspace.
    description: ''
  optionalParameters:
  - name: --subscription
    summary: Name or ID of subscription. You can configure the default subscription using `az account set -s NAME_OR_ID`.
    description: ''
  - name: --yes -y
    summary: Do not prompt for confirmation.
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log_analytics_workspace_saved_search_list
  name: az monitor log-analytics workspace saved-search list
  summary: List all saved searches for a given workspace.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search list --resource-group
                                                         --workspace-name
                                                         [--query-examples]
                                                         [--subscription]
  requiredParameters:
  - isRequired: true
    name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Name of the Log Analytics Workspace.
    description: ''
  optionalParameters:
  - name: --query-examples
    summary: Recommend JMESPath string for you. You can copy one of the query and paste it after --query parameter within double quotation marks to see the results. You can add one or more positional keywords so that we can give suggestions based on these key words.
    description: ''
  - name: --subscription
    summary: Name or ID of subscription. You can configure the default subscription using `az account set -s NAME_OR_ID`.
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log_analytics_workspace_saved_search_show
  name: az monitor log-analytics workspace saved-search show
  summary: Show a saved search for a given workspace.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search show --name
                                                         --resource-group
                                                         --workspace-name
                                                         [--query-examples]
                                                         [--subscription]
  requiredParameters:
  - isRequired: true
    name: --name -n
    summary: Name of the saved search and it's unique in a given workspace.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Name of the Log Analytics Workspace.
    description: ''
  optionalParameters:
  - name: --query-examples
    summary: Recommend JMESPath string for you. You can copy one of the query and paste it after --query parameter within double quotation marks to see the results. You can add one or more positional keywords so that we can give suggestions based on these key words.
    description: ''
  - name: --subscription
    summary: Name or ID of subscription. You can configure the default subscription using `az account set -s NAME_OR_ID`.
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log_analytics_workspace_saved_search_update
  name: az monitor log-analytics workspace saved-search update
  summary: Update a saved search for a given workspace.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search update --name
                                                           --resource-group
                                                           --workspace-name
                                                           [--add]
                                                           [--category]
                                                           [--display-name]
                                                           [--fa]
                                                           [--force-string]
                                                           [--fp]
                                                           [--remove]
                                                           [--saved-query]
                                                           [--set]
                                                           [--subscription]
                                                           [--tags]
  examples:
  - summary: Update a saved search for a given workspace.
    syntax: az monitor log-analytics workspace saved-search update -g MyRG --workspace-name MyWS -n MySavedSearch --category Test1 --display-name TestSavedSearch -q "AzureActivity | summarize count() by bin(timestamp, 1h)" --fa myfun --fp "a:string = value"
  requiredParameters:
  - isRequired: true
    name: --name -n
    summary: Name of the saved search and it's unique in a given workspace.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Name of the Log Analytics Workspace.
    description: ''
  optionalParameters:
  - name: --add
    summary: 'Add an object to a list of objects by specifying a path and key value pairs.  Example: --add property.listProperty <key=value, string or JSON string>.'
    description: ''
  - name: --category
    summary: The category of the saved search. This helps the user to find a saved search faster.
    description: ''
  - name: --display-name
    summary: Display name of the saved search.
    description: ''
  - name: --fa --func-alias
    summary: Function Aliases are short names given to Saved Searches so they can be easily referenced in query. They are required for Computer Groups.
    description: ''
  - name: --force-string
    summary: When using 'set' or 'add', preserve string literals instead of attempting to convert to JSON.
    description: ''
  - name: --fp --func-param
    summary: "The optional function parameters if query serves as a function. Value should be in the following format: 'param-name1:type1 = default_value1, param-name2:type2 = default_value2'. For more examples and proper syntax please refer to https://docs.microsoft.com/en-us/azure/kusto/query/functions/user-defined-functions."
    description: ''
  - name: --remove
    summary: 'Remove a property or an element from a list.  Example: --remove property.list <indexToRemove> OR --remove propertyToRemove.'
    description: ''
  - name: --saved-query -q
    summary: The query expression for the saved search.
    description: ''
  - name: --set
    summary: 'Update an object by specifying a property path and value to set.  Example: --set property1.property2=<value>.'
    description: ''
  - name: --subscription
    summary: Name or ID of subscription. You can configure the default subscription using `az account set -s NAME_OR_ID`.
    description: ''
  - name: --tags
    summary: 'Space-separated tags: key[=value] [key[=value] ...]. Use "" to clear existing tags.'
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
commands:
- az_monitor_log_analytics_workspace_saved_search_create
- az_monitor_log_analytics_workspace_saved_search_delete
- az_monitor_log_analytics_workspace_saved_search_list
- az_monitor_log_analytics_workspace_saved_search_show
- az_monitor_log_analytics_workspace_saved_search_update
globalParameters:
- name: --debug
  summary: Increase logging verbosity to show all debug logs.
- name: --help -h
  summary: Show this help message and exit.
- name: --only-show-errors
  summary: Only show errors, suppressing warnings.
- name: --output -o
  defaultValue: json
  parameterValueGroup: json, jsonc, table, tsv
  summary: Output format.
- name: --query
  summary: JMESPath query string. See <a href="http://jmespath.org/">http://jmespath.org/</a> for more information and examples.
- name: --verbose
  summary: Increase logging verbosity. Use --debug for full debug logs.
metadata:
  doc_source_url_repo: https://github.com/Azure/azure-cli/blob/dev/
  ms.date: 12/14/2020
  description: Manage saved search for log analytics workspace.
