### YamlMime:AzureCLIGroup
uid: az_monitor_log-analytics_workspace_saved-search
name: az monitor log-analytics workspace saved-search
summary: Manage saved search for log analytics workspace.
description: ''
directCommands:
- uid: az_monitor_log-analytics_workspace_saved-search_create
  name: az monitor log-analytics workspace saved-search create
  summary: Create a saved search for a given workspace.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search create --category
                                                           --display-name
                                                           --name
                                                           --resource-group
                                                           --saved-query
                                                           --workspace-name
                                                           [--fa]
                                                           [--fp]
                                                           [--tags]
  examples:
  - summary: Create a saved search for a given workspace.
    syntax: az monitor log-analytics workspace saved-search create -g MyRG --workspace-name MyWS -n MySavedSearch --category Test1 --display-name TestSavedSearch -q "AzureActivity | summarize count() by bin(TimeGenerated, 1h)" --fa myfun --fp "a:string = value"
  requiredParameters:
  - isRequired: true
    name: --category
    summary: The category of the saved search. This helps the user to find a saved search faster.
    description: ''
  - isRequired: true
    name: --display-name
    summary: Display name of the saved search.
    description: ''
  - isRequired: true
    name: --name -n
    summary: Name of the saved search and it's unique in a given workspace.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --saved-query -q
    summary: The query expression for the saved search.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Name of the Log Analytics Workspace.
    description: ''
  optionalParameters:
  - name: --fa --func-alias
    summary: Function Aliases are short names given to Saved Searches so they can be easily referenced in query. They are required for Computer Groups.
    description: ''
  - name: --fp --func-param
    summary: "The optional function parameters if query serves as a function. Value should be in the following format: 'param-name1:type1 = default_value1, param-name2:type2 = default_value2'. For more examples and proper syntax please refer to https://docs.microsoft.com/azure/kusto/query/functions/user-defined-functions."
    description: ''
  - name: --tags
    summary: 'Space-separated tags: key[=value] [key[=value] ...]. Use "" to clear existing tags.'
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log-analytics_workspace_saved-search_delete
  name: az monitor log-analytics workspace saved-search delete
  summary: Delete a saved search for a given workspace.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search delete [--ids]
                                                           [--name]
                                                           [--resource-group]
                                                           [--subscription]
                                                           [--workspace-name]
                                                           [--yes]
  optionalParameters:
  - name: --ids
    summary: One or more resource IDs (space-delimited). It should be a complete resource ID containing all information of 'Resource Id' arguments. You should provide either --ids or other 'Resource Id' arguments.
    description: ''
  - name: --name --saved-search-name -n
    summary: Name of the saved search and it's unique in a given workspace.
    description: ''
  - name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - name: --subscription
    summary: Name or ID of subscription. You can configure the default subscription using `az account set -s NAME_OR_ID`.
    description: ''
  - name: --workspace-name
    summary: The name of the workspace.
    description: ''
  - name: --yes -y
    defaultValue: "False"
    summary: Do not prompt for confirmation.
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log-analytics_workspace_saved-search_list
  name: az monitor log-analytics workspace saved-search list
  summary: List all saved searches for a given workspace.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search list --resource-group
                                                         --workspace-name
  requiredParameters:
  - isRequired: true
    name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: The name of the workspace.
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log-analytics_workspace_saved-search_show
  name: az monitor log-analytics workspace saved-search show
  summary: Show a saved search for a given workspace.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search show [--ids]
                                                         [--name]
                                                         [--resource-group]
                                                         [--subscription]
                                                         [--workspace-name]
  optionalParameters:
  - name: --ids
    summary: One or more resource IDs (space-delimited). It should be a complete resource ID containing all information of 'Resource Id' arguments. You should provide either --ids or other 'Resource Id' arguments.
    description: ''
  - name: --name --saved-search-name -n
    summary: Name of the saved search and it's unique in a given workspace.
    description: ''
  - name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - name: --subscription
    summary: Name or ID of subscription. You can configure the default subscription using `az account set -s NAME_OR_ID`.
    description: ''
  - name: --workspace-name
    summary: The name of the workspace.
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log-analytics_workspace_saved-search_update
  name: az monitor log-analytics workspace saved-search update
  summary: Update a saved search for a given workspace.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search update --name
                                                           --resource-group
                                                           --workspace-name
                                                           [--category]
                                                           [--display-name]
                                                           [--fa]
                                                           [--fp]
                                                           [--saved-query]
                                                           [--tags]
  examples:
  - summary: Update a saved search for a given workspace.
    syntax: az monitor log-analytics workspace saved-search update -g MyRG --workspace-name MyWS -n MySavedSearch --category Test1 --display-name TestSavedSearch -q "AzureActivity | summarize count() by bin(TimeGenerated, 1h)" --fa myfun --fp "a:string = value"
  requiredParameters:
  - isRequired: true
    name: --name -n
    summary: Name of the saved search and it's unique in a given workspace.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name of resource group. You can configure the default group using `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Name of the Log Analytics Workspace.
    description: ''
  optionalParameters:
  - name: --category
    summary: The category of the saved search. This helps the user to find a saved search faster.
    description: ''
  - name: --display-name
    summary: Display name of the saved search.
    description: ''
  - name: --fa --func-alias
    summary: Function Aliases are short names given to Saved Searches so they can be easily referenced in query. They are required for Computer Groups.
    description: ''
  - name: --fp --func-param
    summary: "The optional function parameters if query serves as a function. Value should be in the following format: 'param-name1:type1 = default_value1, param-name2:type2 = default_value2'. For more examples and proper syntax please refer to https://docs.microsoft.com/azure/kusto/query/functions/user-defined-functions."
    description: ''
  - name: --saved-query -q
    summary: The query expression for the saved search.
    description: ''
  - name: --tags
    summary: 'Space-separated tags: key[=value] [key[=value] ...]. Use "" to clear existing tags.'
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
commands:
- az_monitor_log-analytics_workspace_saved-search_create
- az_monitor_log-analytics_workspace_saved-search_delete
- az_monitor_log-analytics_workspace_saved-search_list
- az_monitor_log-analytics_workspace_saved-search_show
- az_monitor_log-analytics_workspace_saved-search_update
globalParameters:
- name: --debug
  summary: Increase logging verbosity to show all debug logs.
- name: --help -h
  summary: Show this help message and exit.
- name: --only-show-errors
  summary: Only show errors, suppressing warnings.
- name: --output -o
  defaultValue: "json"
  parameterValueGroup: "json, jsonc, table, tsv"
  summary: Output format.
- name: --query
  summary: JMESPath query string. See <a href="http://jmespath.org/">http://jmespath.org/</a> for more information and examples.
- name: --subscription
  summary: Name or ID of subscription. You can configure the default subscription using `az account set -s NAME_OR_ID`.
- name: --verbose
  summary: Increase logging verbosity. Use --debug for full debug logs.
metadata:
  doc_source_url_repo: https://github.com/Azure/azure-cli/blob/dev/
  ms.date: 12/27/2022
  description: Manage saved search for log analytics workspace.
